hathienhai4/STM32_LAB01/Project/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define O_Pin GPIO_PIN_4
#define O_GPIO_Port GPIOA
#define I_Pin GPIO_PIN_5
#define I_GPIO_Port GPIOA
#define II_Pin GPIO_PIN_6
#define II_GPIO_Port GPIOA
#define III_Pin GPIO_PIN_7
#define III_GPIO_Port GPIOA
#define IV_Pin GPIO_PIN_8
#define IV_GPIO_Port GPIOA
#define V_Pin GPIO_PIN_9
#define V_GPIO_Port GPIOA
#define VI_Pin GPIO_PIN_10
#define VI_GPIO_Port GPIOA
#define VII_Pin GPIO_PIN_11
#define VII_GPIO_Port GPIOA
#define VIII_Pin GPIO_PIN_12
#define VIII_GPIO_Port GPIOA
#define IX_Pin GPIO_PIN_13
#define IX_GPIO_Port GPIOA
#define X_Pin GPIO_PIN_14
#define X_GPIO_Port GPIOA
#define XI_Pin GPIO_PIN_15
#define XI_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
